# coding: utf-8
# license: GPLv3


class Star:
    def __init__(self):
        self.type = "star"
        """Признак объекта звезды"""
    
        self.m = 0
        """Масса звезды"""
    
        self.x = 0
        """Координата по оси **x**"""
    
        self.y = 0
        """Координата по оси **y**"""
    
        self.Vx = 0
        """Скорость по оси **x**"""
    
        self.Vy = 0
        """Скорость по оси **y**"""
    
        self.Fx = 0
        """Сила по оси **x**"""
    
        self.Fy = 0
        """Сила по оси **y**"""
    
        self.R = 5
        """Радиус звезды"""
    
        self.color = "red"
        """Цвет звезды"""
    
        self.image = None
        """Изображение звезды"""


class Planet:
    """Тип данных, описывающий планету.
    Содержит массу, координаты, скорость планеты,
    а также визуальный радиус планеты в пикселах и её цвет
    """

    type = "planet"
    """Признак объекта планеты"""

    m = 0
    """Масса планеты"""

    x = 0
    """Координата по оси **x**"""

    y = 0
    """Координата по оси **y**"""

    Vx = 0
    """Скорость по оси **x**"""

    Vy = 0
    """Скорость по оси **y**"""

    Fx = 0
    """Сила по оси **x**"""

    Fy = 0
    """Сила по оси **y**"""

    R = 5
    """Радиус планеты"""

    color = "green"
    """Цвет планеты"""

    image = None
    """Изображение планеты"""
